Documents/ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбытиеПоБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбытиеПоНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбытиеПоЕПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчетЕПС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	Элементы.ЦеннаяБумага.ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.Организация, Объект.КоррСчет);
	УстановитьЗаголовкиИДоступностьСубконтоЕПС(ЭтаФорма, Объект.Организация, Объект.КоррСчетЕПС);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Рынок = Перечисления.РынкиЦенныхБумаг.Облигации;
	
	Объект.КоррСчет = ПланыСчетов.Основной.ПрочиеРасходы;
	Объект.Субконто1 = ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_ПрекращениеПризнанияОблигацииКорп"); // как-бы госы не банкротятся
	Объект.Субконто3 = Перечисления.ВидыОбращенияНаОРЦБ.НеОбращается; // обращающиеся не списываем
	
	Объект.КоррСчетЕПС = ПланыСчетов.Единый.ВыбытиеИРеализация10;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	Объект.ВыбытиеПоБУ = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВестиБухгалтерскийУчет");
	Объект.ВыбытиеПоНУ = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВестиНалоговыйУчет");
	Объект.ВыбытиеПоЕПС = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВестиЕдиныйБухгалтерскийУчет");
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура РынокПриИзменении(Элемент)

	Элементы["ЦеннаяБумага"].ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
	
КонецПроцедуры

&НаКлиенте
Процедура КоррСчетПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.Организация, Объект.КоррСчет);
	
	Для Инд = 1 По 3 Цикл
		Если НЕ ЭтаФорма.Элементы["Субконто" + Строка(Инд)].Доступность Тогда
			Объект["Субконто" + Строка(Инд)] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КоррСчетЕПСПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконтоЕПС(ЭтаФорма, Объект.Организация, Объект.КоррСчетЕПС);
	
	Для Инд = 1 По 3 Цикл
		Если НЕ ЭтаФорма.Элементы["СубконтоЕПС" + Строка(Инд)].Доступность Тогда
			Объект["Субконто" + Строка(Инд)] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)
	
	Если Объект.КоррСчет = ПредопределенноеЗначение("ПланСчетов.Основной.ПрочиеРасходы") Тогда
		Объект.Субконто2 = Объект.ЦеннаяБумага;
	КонецЕсли;
	
	Если Объект.КоррСчетЕПС = ПредопределенноеЗначение("ПланСчетов.Единый.ВыбытиеИРеализация10") Тогда
		Объект.СубконтоЕПС1 = Объект.ЦеннаяБумага;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбытиеПоБУПриИзменении(Элемент)
	
	ПриИзмененииВидовУчета();
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбытиеПоНУПриИзменении(Элемент)
	
	ПриИзмененииВидовУчета();
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбытиеПоЕПСПриИзменении(Элемент)
	
	ПриИзмененииВидовУчета();
	УправлениеВидимостью();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПриИзмененииВидовУчета()

	Если НЕ Объект.ВыбытиеПоБУ И НЕ Объект.ВыбытиеПоНУ Тогда // почистим КорСчет
	
		Объект.КоррСчет = ПредопределенноеЗначение("ПланСчетов.Основной.ПустаяСсылка");	
		Объект.Субконто1 = Неопределено;
		Объект.Субконто2 = Неопределено;
		Объект.Субконто3 = Неопределено;
	
	КонецЕсли;
	
	Если НЕ Объект.ВыбытиеПоЕПС Тогда // почистим КорСчетЕПС
	
		Объект.КоррСчетЕПС = ПредопределенноеЗначение("ПланСчетов.Единый.ПустаяСсылка");	
		Объект.СубконтоЕПС1 = Неопределено;
		Объект.СубконтоЕПС2 = Неопределено;
		Объект.СубконтоЕПС3 = Неопределено;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()

	ВестиБУ = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВестиБухгалтерскийУчет");
	ВестиНУ = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВестиНалоговыйУчет");
	ВестиЕПС = БухгалтерскийУчет.ОпределитьНастройкуУчета(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, "ВестиЕдиныйБухгалтерскийУчет");
	
	ЭтаФорма.Элементы.ВыбытиеПоБУ.Доступность = ВестиБУ;
	ЭтаФорма.Элементы.ВыбытиеПоНУ.Доступность = ВестиНУ;
	ЭтаФорма.Элементы.ВыбытиеПоЕПС.Доступность = ВестиЕПС;
	
	ЭтаФорма.Элементы.ГруппаСчет.Видимость = Объект.ВыбытиеПоБУ ИЛИ Объект.ВыбытиеПоНУ;
	ЭтаФорма.Элементы.ГруппаСчетЕПС.Видимость = Объект.ВыбытиеПоЕПС;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Организация, Счет)

	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"Субконто1",
		"Субконто2",
		"Субконто3",
		"Подразделение");

	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Организация, Счет, Форма, ПоляФормы);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконтоЕПС(Форма, Организация, Счет)

	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоЕПС1",
		"СубконтоЕПС2",
		"СубконтоЕПС3",
		"Подразделение");

	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Организация, Счет, Форма, ПоляФормы);

КонецПроцедуры
